{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Halo selamat sore",
        "Test hy selamat siang",
        "Halo Selamat pagi",
        "Halo Selamat siang",
        "Halo selamat siang saya ingin interview",
        "Hy kak saya ingin interview",
        "Halo saya ingin interview",
        "Halo kak",
        "Hy kak",
        "Halo"
      ],
      "responses": [
        "Halo, terimakasih sudah hadir di interview kali ini, Sebelumnya, kamu boleh perkenalan diri dulu ya?",
        "Halo, terimakasih sudah menyempatkan waktunya hadir di interview kali ini, Oke kamu boleh perkenalan diri terlebih dahulu?",
        "Selamat sore, terimakasih sudah hadir pada interview kali ini, oke silahkan porkenalkan diri terlebih dahulu?",
        "Hy, Terimakasih sudah hadir di interview kali ini, baik silahkan kamu perkenalkan diri terlebih dahulu?",
        "Baik mari kita mulai dengan pertanyaan pertama. Ceritakan tentang diri kamu dan bagaimana kamu tertarik dalam pengembangan perangkat lunak."
      ]
    },
    {
      "tag": "intro",
      "patterns": [
        "Halo, saya aldo marcelino umur saya 22 tahun, berdomisili di Semarang, bakcgroung pendidikan teknik informatika UDINUS, dan baru lulus tahun ini",
        "Perkenalkan saya Aldo Marcelino, Umur saya 22 tahun, Domisili saya di Semarang dan background pedidikan saya adalah Teknik Informatika dari Udinus, lulusan tahun 2024, dan saya tertarik dalam developing sofware/aplikasi karena dapat meningkatkan kinerja dan akurasi dalam penginputan data",
        "Jadi, perkenalkan saya, Umur saya tahun, Domisili saya di, Dan background pedidikan saya adalah lulusan di , ilmu komputer, baru lulus tahun",
        "Jadi, perkenalkan saya Aldo Marcelino, Umur saya 22 tahun, Domisili saya di Semarang dan background pedidikan saya adalah Teknik Informatika dari Udinus, lulusan tahun 2024",
        "Perkenalkan nama saya, saya tinggal",
        "Halo, saya. Saya adalah seorang dengan latar belakang di [Industri]. Saya memiliki keahlian dalam , dan saya sangat bersemangat untuk berkontribusi di. Saya percaya bahwa sejalan dengan nilai-nilai saya, dan saya yakin dapat memberikan kontribusi yang berarti",
        "Oke, perkenalkan saya ,saya mahasiswa fresh graduate dari universitas, lulus pada tahun",
        "Halo, saya . Saya memiliki latar belakang dalam , dengan pengalaman kerja selama . Saya sangat bersemangat untuk berkontribusi dalam peran ini dan membawa yang saya miliki ke tim Anda.",
        "Hai, saya. Saya seorang  dan telah bekerja di industri [Industri] selama . Pada pekerjaan terakhir saya di, saya fokus pada. Saya tertarik dengan peran ini karena dan percaya bahwa akan membantu saya berhasil di tim ini.",
        "Oke, saya mahasiswa teknik informatika, masih fresh graduet",
        "Oke perkenalkan nama saya saya sebelumnya sudah lulus bootcamp fullstack javascript dan mendapat perolehan nilai bagus, dan saya sudah tertarik untuk coding dari saya sma"
      ],
      "responses": [
        "Oke baik, kalo begitu bisa jelaskan pengalaman bekerja kamu seperti apa sebelumnya?",
        "Baik, bisa jelaskan project-project seperti apa yang sudah pernah dibangun sebelumnya?",
        "Terus saya lihat di profile kamu udah pengalaman bekerja sebagai tech web dan juga mobile developer. Itu seperti apa,  boleh diceritakan nggak?",
        "Apa yang membuat kamu tertarik untuk menjadi seorang programmer?",
        "Oke, I see. Berarti kamu dulu background-nya adalah tekink Informatika ya? Berarti ya?",
        "Oke, baik bisa ceritakan pengalaman kamu saat pembuatan skripsi, project seperti apa yang dibuat?",
        "Ooo I see, oke bisa ceritakan pengalaman kamu saat pembuatan TA di teknik informatika, project seperti apa yang dibuat?",
        "Oke, Terus kamu ngerjain project sendiri atau kelompok tim boleh cerita lebih detail lagi gak?",
        "Okey itu kamu berapa kali ngerjain projekan kayak gitu, Total tuh berapa ya? Saya nggak begitu ingat",
        "Oh, oke. Dari setiap project itu kamu ngerjain berapa lama, misalnya?"
      ]
    },
    {
      "tag": "project",
      "patterns": [
        "saya belum pernah bekerja, namun pernah bikin projectan untuk anak anak semester 7 gitu",
        "saya belum pernah bekerja, namun pernah membuat projectan dari dosen semacam cms gitu menggunakan php",
        "skripsi saya tentang sistem presensi berbasis mobile dengan face recognition dimana saya membangun aplikasi untuk mahasiswa dapat melakukan presensi dari handphonenya masing masing",
        "Sebelumnya, saya telah berpartisipasi dalam beberapa  project yang mencakup berbagai bidang pengembangan perangkat lunak. Salah satu proyek menarik yang pernah saya kerjakan adalah aplikasi manajemen tugas berbasis web. Saya bertanggung jawab atas pengembangan bagian frontend menggunakan React dan mengintegrasikannya dengan backend menggunakan Node.js dan Express. Aplikasi ini memungkinkan pengguna untuk membuat, mengelola, dan memantau proyek-proyek mereka secara efisien.",
        "Pengalaman sebagai tech web dan mobile developer memungkinkan saya untuk memahami kebutuhan pengembangan perangkat lunak dari berbagai perspektif. Dalam proyek-proyek tersebut, saya belajar mengelola kompleksitas pengembangan frontend dan backend, serta memastikan konsistensi dan kualitas pada aplikasi berbasis web dan mobile",
        "Jadi pas saya pertengahan kuliah, saya kan mulai dari semestr 5, semestr 5 itu tahun 2018. Nah setelah itu saya dapat ilmu PHB, Frag Block Coda Ignitor. Nah dari situ-situ saya gunakan ilmu tersebut itu untuk mungkin nyari-nyari, kalau di lain gitu di official account, saya nyari di salah satu official account itu, suka ada yang minta, ada yang bisa ngerjain.",
        "Saya tertarik untuk menjadi seorang developer karena saya percaya bahwa memiliki pemahaman menyeluruh tentang teknologi dari sisi klien hingga sisi server memberikan keunggulan yang besar",
        "Saya tertarik untuk menjadi seorang programmer karena saya percaya bahwa memiliki pemahaman menyeluruh tentang teknologi dari sisi klien hingga sisi server memberikan keunggulan yang besar",
        "Ia benar saya tekink Informatika, dan ambil peminatan sc",
        "Ia benar saya tekink Informatika, dan ambil peminatan rpl",
        "saya mengerjakan satu poyek bisa satu sampai dengan dua bulan"
      ],
      "responses": [
        "Pekerjaan yang menarik! boleh gak berikan informasi lebih lanjut terkait project nya?",
        "Baik, boleh tau tech stack apa aja yang kamu kausai sekarang?",
        "Oke, diperkulihan boleh tau nggak, teknologi apa saja yang kamu bisa?",
        "Oke, sekarang saya ingin tahu teknologi dan bahasa pemprogramman apa saya yang kamu kuasai?",
        "Ooo I see, Klau begitu tolong jelaskan tech stack apa saja yang kamu gunakan",
        "Baik sekarang beritahu saya bahasa pemprograman apa saja yang kamu kausai ?",
        "Oke baik, sekarang saya akan coba tanya pertanyaan basic apa coba jelasin perbedaan antara let, const, dan var dalam JavaScript?"
      ]
    },
    {
      "tag": "testing",
      "patterns": [
        "Saya menguasai bahasa pemprograman javascript, dan python",
        "Tech stack saya saat ini terfokus pada Python, di mana saya memiliki keterampilan yang kuat dalam pengembangan aplikasi menggunakan Django dan Flask. Saya juga memiliki pengalaman dengan ORM seperti SQLAlchemy.",
        "Saya mahir dalam pengembangan dengan Python dan sering menggunakan framework Django dan Flask  untuk proyek-proyek web. Selain itu, saya juga memiliki keahlian dalam mengintegrasikan database, dan sering menggunakan PostgreSQL dan MySQL",
        "saya memiliki keahlian dalam pengembangan aplikasi mobile menggunakan Flutter dan Dart. Saya juga memiliki pengalaman dengan pengembangan natif Android menggunakan Java dan Kotlin. Selain itu, saya familiar dengan penggunaan Firebase sebagai backend untuk aplikasi mobile.",
        "Tech stack yang saya kuasai saat ini terfokus pada pengembangan aplikasi mobile. Saya memiliki keterampilan yang kuat dalam menggunakan React Native untuk pengembangan cross-platform, dan saya juga berpengalaman dengan pengembangan natif Android menggunakan Kotlin",
        "Keahlian utama saya terletak pada pengembangan aplikasi mobile. Saya mahir menggunakan Swift dan SwiftUI untuk pengembangan aplikasi iOS, serta memiliki pengalaman dalam pengembangan natif Android menggunakan Java dan Kotlin. Selain itu, saya memiliki pengetahuan dalam integrasi API dan penggunaan Git untuk manajemen kode.",
        "Sisi frontend saya mengusai  framework react.js, redux toolkit, redux thunk, vue.js, ajax. sedangkan bagian backend saya mengusai node.js, exprress.js, graphql, mysql, postgesql, mongodb",
        "Saya memiliki pengetahuan dan keterampilan dalam menggunakan Node.js untuk pengembangan server, serta Express.js sebagai kerangka kerja web. Saya juga memiliki pengalaman dengan database SQL dan NoSQL seperti MySQL dan MongoDB.",
        "Pemrograman yang saya kuasai seperti Python untuk keperluan scripting dan pengembangan backend. Pengalaman saya juga mencakup penggunaan Git untuk kontrol versi dan GitHub untuk kolaborasi tim",
        "Di sisi frontend, saya memiliki keahlian dalam menggunakan HTML, CSS, dan JavaScript. Saya juga memiliki pengalaman luas dengan kerangka kerja React untuk membangun antarmuka pengguna yang dinamis dan responsif.",
        "sebagai Full Stack JavaScript developer, saya dapat menyediakan solusi end-to-end dalam pengembangan perangkat lunak, mulai dari frontend hingga backend. Saya juga selalu tertarik untuk terus mempelajari dan menggali lebih dalam tentang teknologi baru yang relevan dengan industri ini",
        "Let itu digunakan untuk variable yang ingin kita rubah valuenya, const tidak dapat di rubah, dan va untuk variable global tidak terikat dengan scop",
        "Let digunakan saat value dari variable ingin diubah, const valuenya tidak dapat dirubah dan var jika ingin menggunakan variable secara global"
      ],
      "responses": [
        "Oke baik kamu memeliki requrement yang sesuai dengan posisi dengan yang kami cari, boleh tau apakah kamu dapat bekerja sama dengan tim?",
        "Tentu, persyaratan yang kamu miliki sangat cocok dengan kebutuhan posisi ini. Bisakah kamu berkolaborasi dengan tim secara efektif?",
        "Bagus, kualifikasi yang kamu punya sesuai dengan yang kami butuhkan. kamu ada masalah nggak untuk bekerja dalam tim?",
        "Menarik, kamu memiliki kualifikasi yang sesuai dengan kebutuhan kami. Apakah kamu memiliki kemampuan untuk bekerja dalam tim dengan baik?",
        "Oke, kualifikasi yang kamu miliki cocok dengan posisi yang kami tawarkan. Bagaimana dengan kemampuan bekerja sama dalam tim?"
      ]
    },
    {
      "tag": "soft_skill",
      "patterns": [
        "saya tidak ada masalah dengan kerjasama tim, saya sangat mudah untuk beradaptasi dan mampu bekerja berkolaborasi bersama",
        "Ya, saya sangat bisa bekerja sama dengan tim, dan dapat dengan cepat beradaptasi dalam kerja kolaborasi",
        "Ya, saya memiliki pengalaman yang baik dalam bekerja dalam tim pada proyek-proyek sebelumnya. Saya percaya bahwa kolaborasi yang baik membawa hasil yang lebih baik, dan saya selalu siap berkontribusi dengan anggota tim untuk mencapai tujuan bersama",
        "Saya memang memiliki kemampuan bekerja mandiri, tetapi saya juga sangat menghargai dan menyukai kerja tim. Saya yakin dapat beradaptasi dengan baik dalam lingkungan tim dan memberikan kontribusi positif untuk mencapai kesuksesan bersama.",
        "Berdasarkan pengalaman kerja saya sebelumnya, saya telah bekerja dalam tim yang beragam. Saya memahami pentingnya komunikasi efektif, mendengarkan ide-ide rekan tim, dan bekerja sama untuk mencapai tujuan bersama. Saya yakin dapat memberikan nilai tambah di lingkungan kerja tim",
        "Saya memiliki track record yang baik dalam proyek-proyek kolaboratif. Saya aktif berpartisipasi dalam diskusi, mendukung rekan tim, dan bersedia berbagi pengetahuan. Saya sangat terbuka untuk belajar dari orang lain dan berkontribusi pada keberhasilan tim"
      ],
      "responses": [
        "Okey noted, hmmm kalo boleh tau apa kelemahan dan kekuatan kamu dari yang lain?",
        "Baik, dicatat. Bagaimana menurutmu tentang kelebihan dan kelemahan yang kamu miliki dibandingkan dengan orang lain?",
        "Oke, dicatat ya. Bagaimana menurutmu perbandingan kekuatan dan kelemahanmu dibandingkan teman kuliah yang lain?",
        "Paham, jadi apa menurutmu keunggulan dan kelemahanmu dibandingkan dengan rekan-rekan sekerja lainnya?",
        "Noted. Saya ingin tahu, menurutmu apa kekuatan dan kelemahanmu dibandingkan dengan orang lain yang mungkin memiliki latar belakang dan keterampilan serupa?",
        "Baik, terus bagaimana kamu menangani situasi ketika kamu menghadapi kendala dalam pengembangan?",
        "Oke baik, jika kamu mengalami hambatan selama proses pengembangan, bagaimana cara kamu mengatasi tantangan tersebut?",
        "Baik, apakah kamu bisa memberikan contoh bagaimana kamu akan menangani kendala yang muncul pada tahap development?"
      ]
    },
    {
      "tag": "solving",
      "patterns": [
        "Pertama tama saya akan tracking terlebih dahulu permasalahanya ada pada sisi mana, kemudian melihat pesan errornya seperti apa, dan dari situ saya dapat mengambil langkah fixing, namun jika tidak ketemu saya tidak akan ragu untuk bertanya pada tim ataupun rekan lain",
        "Salah satu kekuatan saya adalah kemampuan untuk cepat memahami dan mengatasi masalah. Saya percaya kemampuan ini membantu saya memberikan kontribusi maksimal dalam proyek-proyek yang kompleks.",
        "Saya memiliki latar belakang yang kuat dalam backend, dan ini memberi saya keunggulan dalam memahami detail dan mengambil keputusan yang terinformasi.",
        "Kemampuan komunikasi saya yang baik memungkinkan saya berkolaborasi dengan berbagai tim dan merangkul ide-ide dari berbagai latar belakang.",
        "Dalam mengatasi kendala tersebut, langkah pertama saya adalah melakukan analisis mendalam untuk memahami akar permasalahan. Saya akan merinci bagian-bagian kritis dari integrasi dan memeriksa dokumentasi serta log untuk mencari tahu sumber masalahnya. Setelah itu, saya akan melakukan percobaan dan uji coba untuk mengidentifikasi solusi yang mungkin",
        "jika saya tidak dapat menemukan solusi yang memadai, langkah selanjutnya adalah berkonsultasi dengan anggota tim atau sumber daya lain yang mungkin memiliki pengalaman atau wawasan yang dapat membantu. Kolaborasi tim seringkali membawa sudut pandang baru dan solusi yang efektif",
        "Pertama, saya mencoba untuk memahami akar masalahnya terlebih dahulu. Setelah itu, saya berkomunikasi dengan tim untuk mendapatkan perspektif tambahan dan mencari solusi bersama. Saya juga tidak ragu untuk mencari saran dari rekan kerja yang lebih berpengalaman jika diperlukan.",
        "Ketika menghadapi kendala, saya cenderung memecah masalah menjadi bagian-bagian yang lebih kecil. Saya akan mengevaluasi setiap komponen dan mencari solusi secara bertahap. Selain itu, saya selalu membuka diri untuk mencari solusi baru atau mempertimbangkan pendekatan yang belum pernah saya coba sebelumnya",
        "Dalam developing, saya yakin bahwa perencanaan yang matang adalah kunci, tetapi terkadang memang masalah tak terduga muncul. Saya biasanya tetap tenang, mencari pemecahan masalah, dan berkomunikasi secara efektif dengan tim.",
        "Saya akan memberikan pembaruan secara berkala tentang status kendala dan mencari masukan dari rekan tim. Ini membantu memastikan bahwa semua orang berada dalam halaman yang sama dan kita dapat bersama-sama mencari solusi yang paling tepat"
      ],
      "responses": [
        "Oke I got it, saya rasa sudah semua. Kita cukupkan sampai disini saya akan memberikan kabar bagaimana untuk proses berikutnya, silahkan boleh meniggalkan room, terima kasih",
        "Baik, saya sudah memahaminya. Kalau begitu, mari kita akhiri sampai di sini. Saya akan memberikan update mengenai langkah selanjutnya. Terima kasih",
        "Oke, sudah saya mengerti semuanya. Mari kita selesaikan di sini. Nanti saya akan memberikan informasi lebih lanjut mengenai proses selanjutnya. Thankyouu",
        "Baiklah, saya paham. Kita cukupkan pembahasan di sini. Saya akan memberikan kabar lebih lanjut mengenai langkah berikutnya. Silakan tinggalkan ruangan kapan pun Anda siap.",
        "Oke, saya telah memahami. Mari kita selesai di sini. Saya akan memberi tahu Anda nanti mengenai langkah selanjutnya. Terima kasih",
        "Baiklah. Kita bisa mengakhiri percakapan di sini. Saya akan memberikan update mengenai proses berikutnya. Jika tidak ada lagi yang perlu dibahas, sudah boleh leave. Terima kasih"
      ]
    },
    {
      "tag": "thanksgiving",
      "patterns": [
        "Terima kasih banyak",
        "Thanks",
        "Thank you",
        "Terima Kasih",
        "Makasih",
        "Makasih kak"
      ],
      "responses": [
        "Sama-sama, senang bisa membantu!",
        "Tidak masalah, selalu siap membantu!",
        "Terima kasih juga telah datang!",
        "Terima kasih juga telah hadir!",
        "Sama-sama, senang bisa berbincang!",
        "Sama-sama, sudah boleh leave yah"
      ]
    }
  ]
}
